
{
  "title":"Final Project",
  "content":"Your task is to make something nifty using primarily C or C++. The title of your project should be a statement of the problem it solves. For example:\n\u0026ldquo;I don\u0026rsquo;t have an egg timer GUI that plays a cool sound.\u0026rdquo; \u0026ldquo;There\u0026rsquo;s no game about placing pepperonis on pizza without any of them touching.\u0026rdquo; \u0026ldquo;Not every photo of a person\u0026rsquo;s face has a hat.\u0026rdquo; \u0026ldquo;None of the N-Queens solvers were written by me.\u0026rdquo; The only requirements are that the project is appropriate in size for the number of people working on it, that it compiles and runs without any significant problems, and that you link with at least one third party library. We list some libraries you might be interested in below.\nUse this as an opportunity to use many of the language features we presented in class, perhaps more than are actually called for by your project.\nIf your project doesn\u0026rsquo;t run on Windows, Linux, or OS X (maybe it runs on phones or robots), you should submit a short video of it in operation.\nStarter Kit If you\u0026rsquo;re having trouble getting started, perhaps you\u0026rsquo;ll find what you need in the Starter Kit!\nExample Projects Countdown Use wxWidgets to create a countdown clock. Then keep going: allow multiple countdowns, display the time in words, or make it look cool.\nPepperoni Placement Use Cinder to create a game where you place pepperonis on a pizza without any of them overlapping or going off the edge. (It\u0026rsquo;s fun in real life, trust me.) Then keep going: by the end of their tutorial, you\u0026rsquo;d have a particle system with which you could add sweet effects.\nThird-Party Libraries You must use at least one third-party library. Here\u0026rsquo;s a list you can use for inspiration. Can you think of more?\n2D/3D Games Cinder openFrameworks SFML Allegro SDL OpenGL Ogre Irrlicht GUI Qt wxWidgets GTK+ Graphics Cairo libpng ImageMagick Haru Free PDF Library Audio PortAudio Synthesis ToolKit RtAudio libsndfile fftw sox Database sqlite3 Math cblas Physics Chipmunk Bullet Box2D AI OpenCV Utility Boost ncurses libxml2 zlib Web curl "}


