
{
  "title":"Starter Kit",
  "content":"Starting a C or C++ project from scratch can be a daunting task. If you\u0026rsquo;re having trouble picking a software library, installing it on your system, and testing that it works, maybe you should try this Starter Kit!\nThis Starter Kit uses the libpng library to render a series of random lines as a PNG image. The images look like this:\nThe example code was written by skimming the section of the libpng manual (PDF) on how to write PNG files. That manual also has a section on reading PNG files that you might find useful.\nUse this kit to bootstrap your project and your imagination! The deadline looms, but there\u0026rsquo;s still plenty of time to have fun making silly little PNG files!\nSource Code lines (C)\nCompiling $ gcc -Wall -std=c99 lines.c -lpng -o lines\nThe -lpng flag is short for -l png, which links the png library with your project to create the program.\nRunning $ ./lines\n./lines creates a file called out.png in the current directory with some crazy graphics inside.\nTo view your image, you can use the scp command to copy it to your computer.\nUnderstand It In the spirit of lab exercises, here are a few tasks to direct your focus to the parts of the program that matter:\nMake the program take the filename as a command-line argument instead of hard-coding \u0026ldquo;out.png\u0026rdquo;. Tweak the values that are assigned to r, g, b, and a in the loop labeled \u0026ldquo;draw a bunch of vertical lines\u0026rdquo;. The values range from 0 to 255. You should do this if you don\u0026rsquo;t understand how pixels work. Wikipedia has a nice section on pixel colors. Memory is allocated for storing the image data, but it\u0026rsquo;s never freed. You should free it. You\u0026rsquo;ll definitely need to do this if you use this code as a base for your project! Tweak the program to draw horizontal lines instead of vertical ones. What Next? Here are some concrete project ideas that you can implement and submit, roughly in order of increasing difficulty.\nWhatever you do, start (very) small and add features as time allows. The secret to success here is to be unambitious at first.\nPlot a Graph Instead of drawing lines of random height, allow users to plot a bar graph by providing numbers as program arguments or using stdin.\nDraw Shapes Draw shapes of various colors. Start with squares, then move on to lines and circles if you have more time or people.\nOptionally, convert the program to C++ and create a Shape parent class with sub-classes for each type of shape.\nDraw Text Read text from stdin and draw it on the image by changing pixel colors in the patterns of (very simple) letters. Here\u0026rsquo;s an example of how you might render \u0026lsquo;hi\u0026rsquo;:\nInstead of hard-coding how to draw each letter shape, I recommend storing them as strings or in a separate file, but this is not necessary.\nInvert an Image Read a PNG image (with libpng), flip it upside-down, and save it as a new image. Here\u0026rsquo;s an example program that reads and writes PNG files.\nGame of Life Implement the Game of Life and render each time step as a separate PNG file.\n"}


